tutorials/compressibleVoF/depthCharge2D/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        surfaces;

    defaultValue 1;

    surfaces
    {
        bubble
        {
            type        cylinder;

            point1      (0.5 0.5 -1);
            point2      (0.5 0.5 1);
            radius      0.1;

            value       0;
        }

        air
        {
            type        plane;

            point       (0 1 0);
            normal      (0 -1 0);

            value       0;
        }
    }
}

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
